{"data":{"markdownRemark":{"html":"<h1>06 - Tags</h1>\n<p>Notes can have multiple tags, which are useful for better categorization.</p>\n<h2>Syntax</h2>\n<ul>\n<li>\n<p><strong>Root</strong>: Root tags don't contain any forward slash (<code>/</code>). If there are any notebooks or templates defined they will be rendered inside the special <code>Tags</code> section in the sidebar, otherwise the <code>Tags</code> parent section will be omitted.</p>\n</li>\n<li>\n<p><strong>Nested</strong>: Tags can also be nested, <em>indefinitely</em>, just write them like a path, separating the levels with a forward slash: <code>foo/bar/baz</code>.</p>\n</li>\n</ul>\n<h2>Special Tags</h2>\n<ul>\n<li>\n<p><strong>Notebooks</strong>: You've probably noticed that Notable supports notebooks too. To create one just add a tag starting with <code>Notebooks/</code> to a note. </p>\n</li>\n<li>\n<p><strong>Templates</strong>: Notable also supports Templates, to create one just add the <code>Templates</code> tag to a note. Of course nesting is supported here too, i.e. <code>Templates/Work</code>.</p>\n</li>\n</ul>\n<p>Feel free to use these features, if you don't need them their icons won't be displayed in the sidebar.</p>\n<h2>Collapse/Expand</h2>\n<p>Tags with children can be collapsed/expanded, just right-click them and select the option or double-click them.</p>\n<h2>Editing</h2>\n<p>There are multiple ways to add/remove tags:</p>\n<ul>\n<li><strong>Single-note editing</strong>: There's a button in the toolbar for editing a note's tags.</li>\n<li><strong>Multi-note editing</strong>: Tags can be added/removed from multiple notes at once via the <a href=\"@note/09%20-%20Multi-Note%20Editing.md\">multi-note editing</a> features provided.</li>\n<li><strong>Advanced search &#x26; replace</strong>: Alternatively you could just open your data directory with your editor and perform a search &#x26; replace there, this way you can also use advanced features like regexes.</li>\n</ul>","frontmatter":{"title":"06 - Tags"}}},"pageContext":{"slug":"/Tutorial/06 - Tags/"}}